 [
  "You spend about a third of your life sleeping. If you live to be 75 years old, you will have spent roughly 25 years asleep.",
"The average adult's skin weighs around 8 pounds. Your skin is the largest organ in your body and renews itself every 28 days.",
"Red wine contains antioxidants that may help improve heart health. In moderation, it can raise good cholesterol and protect against artery damage.",
"The human brain can store an estimated 2.5 petabytes of data. That's the equivalent of three million hours of TV shows.",
"Humans are the only animals that blush. Blushing is an involuntary response to social emotions, such as embarrassment or shame.",
"Laughter burns calories. A hearty laugh for 10 to 15 minutes can burn up to 40 calories.",
"You lose about 1% of muscle mass every year after the age of 30. Regular exercise can help slow this natural process.",
"Coffee is the world's second most traded commodity, after oil. It's a daily ritual for many, with over 2.25 billion cups consumed worldwide each day.",
"The average adult makes around 35,000 decisions each day. From mundane choices like what to eat for breakfast to life-altering decisions, your brain is constantly at work.",
"Adult friendships can extend your life. Strong social connections have been linked to a longer, healthier life, reducing the risk of many chronic diseases.",
"The average adult will change careers 5 to 7 times in their lifetime. The job market is dynamic, and people are more likely to explore different paths.",
"Your gut has its own brain, known as the enteric nervous system. It controls digestion and is so complex that it's often called the second brain.",
"Travel can make you smarter. Exposure to new cultures, languages, and experiences can increase cognitive flexibility and creativity.",
"Your sense of taste diminishes as you age. By age 60, many people have lost half of their taste buds, which is why older adults may prefer more strongly flavored foods.",
"Adult brains continue to create new neurons. Neurogenesis, the formation of new neurons, occurs in certain brain regions throughout life, especially in areas associated with memory.",
"About 90% of the world's population is right-handed. Left-handedness is less common but has been linked to creativity and different cognitive processing styles.",
"Music can enhance cognitive performance. Listening to music, especially classical, can improve focus, memory, and productivity, known as the Mozart Effect.",
"Adult learning enhances brain plasticity. Engaging in new activities, learning new skills, or even picking up a new hobby can help keep the brain young and flexible.",
"The average adult blinks 15 to 20 times per minute. That’s over 28,000 times a day, helping keep your eyes lubricated and clear of debris.",
"The human nose can detect over 1 trillion different scents. Your sense of smell is incredibly powerful, closely tied to memories and emotions.",
  "Cows have best friends and can become stressed when they are separated.",
    "Honey never spoils. It can last for centuries without going bad.",
    "A group of owls is called a parliament.",
    "Bananas are berries, but strawberries aren't.",
    "The Eiffel Tower can be 15 cm taller during the summer due to thermal expansion.",
    "The average person laughs about 15 times a day.",
    "A single cloud can weigh as much as 1 million pounds.",
    "Your taste buds have a lifespan of about 10 to 14 days.",
    "The longest recorded hiccuping lasted for 68 years!",
    "Bees can recognize human faces.",
    "The world's largest desert is Antarctica.",
    "A day on Venus is longer than a year on Venus.",
    "Butterflies taste with their feet.",
    "The dot over the letter 'i' is called a tittle.",
    "A group of flamingos is called a 'flamboyance.'",
    "The shortest war in history was between Britain and Zanzibar, lasting only 38 minutes.",
    "The smell of freshly-cut grass is actually a plant distress call.",
    "Elephants are the only animals that can't jump.",
    "There are more possible iterations of a game of chess than there are atoms in the observable universe.",
    "The world's oldest toy is a stick, according to archaeological finds."]
